# 라이브러리 = API = 함수 모음집

# 터미널 열어서 pip install 가져오고싶은 라이브러리 이름

#가상환경을 쓰는 이유 : 파이썬은 하나의 버전만 설치 가능한데(1제어판 1파이썬), 가상으로 해놓으면 버전 변경에 원활하다.
# 찐 환경(기본38) - 가상환경 (36버전)
#        - 가상환경 (38버전)...삭제해도 36버전 돌아감
#        ... 컴퓨터 여러대 쓰는 효과

#그냥 복붙한다고 아무데서나 이용할 수 없는데(찐) , 가상환경은 통째로 복사하면 구동 가능하다.
#파이썬의 압축파일 확장자 : WHL(WHEEL) (윈도우 zip, 자바 jar, 웹 war)

#오라클 15개 다 찼을 때
# 1)윈도우-서비스 들어가서 오라클 리스너 끄고 몸통 닫으면 됨. 킬 때는 반대로
# 2) with 절을 쓰고 들여쓰기 해주면 알아서 꺼준다. (오픈 때랑 똑같음)

# 엔터 쳐도 한라인으로 인식 멀티라인 표시 '''...'''


